// # Домашнє завдання - Урок 19

// Для всіх завдань використовувати масив чисел [1,2,3,4,5,6]

// **НЕ ВИКОРИСТОВУЙТЕ ФУНКЦІЇ**
// **НЕ ВИКОРИСТОВУЙТЕ ЖОДЕН З МЕТОДІВ МАСИВІВ**

let array = [1, 2, 3, 4, 5, 6];

// - Написати код який надає такий самий результат як метод pop.

// let i = 1;
// while (i < 6) {
//   console.log(i);
//   i++;
// }

// - Написати код який надає такий самий результат як метод push
// з одним параметром.

// let i = 0;
// while (i < 7) {
//   console.log(i + 1);
//   i++;
// }

// - Написати код який надає такий самий результат як метод filter
// (дія з елементами масиву: вибірка парних чисел).

// for (let i = 1; i <= 7; i++) {
//   if (i % 2 !== 0) continue;
//   console.log(i);
// }

// - Написати код який надає такий самий результат як метод map
// (дія з елементами масиву: множення на 5).

// for (let i = 0; i < 6; i++) {
//   console.log(array[i] * 5);
// }

// - Написати код який надає такий самий результат як метод reduce
// (дія з елементами масиву: отримати суму значень елементів масиву).

// let sum = 0;
// let i = 0;

// while (i < array.length) {
//   sum += array[i];
//   i++;
// }

// console.log(sum);
